InformationRegisters/ВыполнениеСервисныхКампаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ВыполнениеСервисныхКампаний</Name>
			<Comment>Выполнение сервисных кампаний</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Comment>Дата выполнения сервисной кампании</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументВыполнения</Name>
					<Comment>Документ выполнения</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор - пользователь, добавивший VIN в сервисную кампанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>VIN</Name>
					<Comment>VIN</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СервиснаяКампания</Name>
					<Comment>Сервисная кампания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисныеКампании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВыполнениеСервисныхКампаний/Ext/RecordSetModule.bsl
Перем НеИзменятьАвтора Экспорт; // Признак по которому не изменяется автор

Процедура ПередЗаписью(Отказ, Замещение)
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	Если НеИзменятьАвтора Тогда
		Возврат;
	КонецЕсли;
 	
	Для Каждого Запись Из ЭтотОбъект Цикл
		//Бондаренко++ 20260312
		Если  РольДоступна("ПолныеПрава") Тогда
			//Этих пользователей не проверяем
		ИначеЕсли обПраво("НеПроверятьДокументВыполнения") Тогда
			//Этих пользователей также не проверяем
		Иначе	
			Если Не обЗначениеНеЗаполнено(Запись.ДокументВыполнения) Тогда
				Если Запись.ДокументВыполнения.ВидРемонта <> Справочники.ВидыРемонта.ГарантияПроизводителя Тогда
					#Если НаКлиенте Тогда
						СМГ_Сообщить("ОШИБКА! В "+СокрЛП(Запись.ДокументВыполнения)+" вид ремонта "+Запись.ДокументВыполнения.ВидРемонта,СтатусСообщения.ОченьВажное);
					#КонецЕсли
					Отказ = Истина;
					Возврат;
				КонецЕсли;
				Если Запись.ДокументВыполнения.Автомобиль.VIN <> Запись.VIN Тогда
					#Если НаКлиенте Тогда
						СМГ_Сообщить("ОШИБКА! В "+СокрЛП(Запись.ДокументВыполнения)+" VIN "+СокрЛП(Запись.ДокументВыполнения.Автомобиль.VIN)+" не совпадает с "+СокрЛП(Запись.VIN),СтатусСообщения.ОченьВажное);
					#КонецЕсли
					Отказ = Истина;
					Возврат;
				КонецЕсли;
				Если Запись.ДокументВыполнения.Состояние <> Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
					#Если НаКлиенте Тогда
						СМГ_Сообщить("ОШИБКА! В "+СокрЛП(Запись.ДокументВыполнения)+" состояние "+СокрЛП(Запись.ДокументВыполнения.Состояние)+" не равно Закрыт",СтатусСообщения.ОченьВажное);
					#КонецЕсли
					Отказ = Истина;
					Возврат;
				КонецЕсли;
				Если Запись.ДокументВыполнения.СервиснаяКампания <> Запись.СервиснаяКампания Тогда
					#Если НаКлиенте Тогда
						СМГ_Сообщить("ОШИБКА! В "+СокрЛП(Запись.ДокументВыполнения)+" сервисная компания "+СокрЛП(Запись.ДокументВыполнения.СервиснаяКампания)+" не равна "+СокрЛП(Запись.СервиснаяКампания),СтатусСообщения.ОченьВажное);
					#КонецЕсли
					Отказ = Истина;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//Бондаренко-- 20260312
		Запись.Автор=ПараметрыСеанса.Пользователь;
	КонецЦикла;
КонецПроцедуры

НеИзменятьАвтора=Ложь;
